###############################################################################
# Created by write_sdc
# Wed Sep  7 02:25:30 2022
###############################################################################
current_design driver_core
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clock -period 10.0000 [get_ports {clock}]
set_clock_transition 0.1500 [get_clocks {clock}]
set_clock_uncertainty 0.5000 clock
set_propagated_clock [get_clocks {clock}]
create_clock -name clock_a -period 10.0000 [get_ports {clock_a}]
set_clock_transition 0.1500 [get_clocks {clock_a}]
set_clock_uncertainty 0.5000 clock_a
set_propagated_clock [get_clocks {clock_a}]
set_clock_groups -name async_clock -asynchronous \
 -group [get_clocks {clock}]\
 -group [get_clocks {clock_a}] -comment {Async Clock group}
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {col_select_a[0]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {col_select_a[0]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {col_select_a[1]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {col_select_a[1]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {col_select_a[2]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {col_select_a[2]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {col_select_a[3]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {col_select_a[3]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {col_select_a[4]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {col_select_a[4]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {col_select_a[5]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {col_select_a[5]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {data_in_a[0]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {data_in_a[0]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {data_in_a[10]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {data_in_a[10]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {data_in_a[11]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {data_in_a[11]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {data_in_a[12]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {data_in_a[12]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {data_in_a[13]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {data_in_a[13]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {data_in_a[14]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {data_in_a[14]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {data_in_a[15]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {data_in_a[15]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {data_in_a[1]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {data_in_a[1]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {data_in_a[2]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {data_in_a[2]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {data_in_a[3]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {data_in_a[3]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {data_in_a[4]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {data_in_a[4]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {data_in_a[5]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {data_in_a[5]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {data_in_a[6]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {data_in_a[6]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {data_in_a[7]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {data_in_a[7]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {data_in_a[8]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {data_in_a[8]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {data_in_a[9]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {data_in_a[9]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {inverter_select_a}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {inverter_select_a}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {mem_address_a[0]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {mem_address_a[0]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {mem_address_a[1]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {mem_address_a[1]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {mem_address_a[2]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {mem_address_a[2]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {mem_address_a[3]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {mem_address_a[3]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {mem_address_a[4]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {mem_address_a[4]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {mem_address_a[5]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {mem_address_a[5]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {mem_address_a[6]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {mem_address_a[6]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {mem_address_a[7]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {mem_address_a[7]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {mem_address_a[8]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {mem_address_a[8]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {mem_address_a[9]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {mem_address_a[9]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {mem_write_n_a}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {mem_write_n_a}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {output_active_a}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {output_active_a}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {row_col_select_a}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {row_col_select_a}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {row_select_a[0]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {row_select_a[0]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {row_select_a[1]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {row_select_a[1]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {row_select_a[2]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {row_select_a[2]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {row_select_a[3]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {row_select_a[3]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {row_select_a[4]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {row_select_a[4]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -rise -max -add_delay [get_ports {row_select_a[5]}]
set_input_delay 2.0000 -clock [get_clocks {clock_a}] -fall -max -add_delay [get_ports {row_select_a[5]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {driver_io[0]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {driver_io[0]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -rise -max -add_delay [get_ports {driver_io[1]}]
set_output_delay 2.0000 -clock [get_clocks {clock}] -fall -max -add_delay [get_ports {driver_io[1]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {driver_io[1]}]
set_load -pin_load 0.0334 [get_ports {driver_io[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clock}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clock_a}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inverter_select_a}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_write_n_a}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {output_active_a}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {row_col_select_a}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {col_select_a[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {col_select_a[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {col_select_a[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {col_select_a[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {col_select_a[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {col_select_a[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in_a[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in_a[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in_a[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in_a[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in_a[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in_a[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in_a[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in_a[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in_a[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in_a[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in_a[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in_a[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in_a[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in_a[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in_a[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in_a[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_address_a[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_address_a[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_address_a[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_address_a[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_address_a[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_address_a[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_address_a[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_address_a[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_address_a[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mem_address_a[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {row_select_a[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {row_select_a[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {row_select_a[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {row_select_a[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {row_select_a[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {row_select_a[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 10.0000 [current_design]
